### Forest: Snapshot Service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
data.local_file.init: Reading...
data.local_file.init: Read complete after 0s [id=2aeed322cdc4a5f21df477509343ebb65928a18e]
data.external.sources_tar: Reading...
data.digitalocean_project.forest_project: Reading...
data.digitalocean_ssh_keys.keys: Reading...
module.monitoring[0].newrelic_alert_policy.alert: Refreshing state... [id=1299944]
module.monitoring[0].newrelic_notification_channel.slack-channel[0]: Refreshing state... [id=a2ce9190-c989-4184-82e0-b68af8e9947c]
data.external.sources_tar: Read complete after 0s [id=-]
data.local_file.sources: Reading...
data.local_file.sources: Read complete after 0s [id=f0532357e3cf8a07b9a779e69441c528c5220c4f]
data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/8656000852680004208]
digitalocean_droplet.forest: Refreshing state... [id=399691168]
digitalocean_firewall.forest-firewall: Refreshing state... [id=b713aaa4-cdfd-4921-b25d-049935b81577]
data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.monitoring[0].newrelic_workflow.alerting-workflow-slack[0]: Refreshing state... [id=1e900308-e31e-40bd-be6a-5def6587e890]
module.monitoring[0].newrelic_nrql_alert_condition.disk_space: Refreshing state... [id=1299944:5694356]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2024-02-06T09:07:51Z" -> (known after apply)
      ~ disk                 = 200 -> (known after apply)
      ~ id                   = "399691168" -> (known after apply)
      ~ ipv4_address         = "167.71.33.180" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.5" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 16384 -> (known after apply)
        name                 = "prod-forest-snapshot"
      ~ price_hourly         = 0.125 -> (known after apply)
      ~ price_monthly        = 84 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "iac",
            "prod",
        ]
      ~ urn                  = "do:droplet:399691168" -> (known after apply)
      ~ user_data            = (sensitive value) # forces replacement
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # digitalocean_firewall.forest-firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest-firewall" {
      ~ droplet_ids     = [
          - 399691168,
        ] -> (known after apply)
        id              = "b713aaa4-cdfd-4921-b25d-049935b81577"
        name            = "prod-forest-snapshot"
        tags            = []
        # (3 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:399691168",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ ip = [
      - "167.71.33.180",
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/forest-iac/forest-iac/tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/forest-iac/forest-iac/tfplan"
```

</details>